runs/mixingPrecipitation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Domain matches bounding box of pillars_scaled2.stl
// X: 0 .. 1.82e-3 m, Y: 0 .. 9.513844e-4 m, Z: 0 .. 2.3e-5 m
// Inlet face (x = 0) is split into 3 inlets along Y, separated by walls.

scale   1;

// X-stations
x0   0;
x1   1.82e-3;

// Z-stations
z0   0;
z1   2.3e-5;

// Y-stations defining 5 stacked Y-blocks
// inlet1: y0..y1, gap1: y1..y2, inlet2: y2..y3, gap2: y3..y4, inlet3: y4..y5
y0   0;
y1   2.630242e-4;
y2   3.427301e-4;
y3   6.086543e-4;
y4   6.883602e-4;
y5   9.513844e-4;

vertices
(
    // y = y0 (i = 0)
    ($x0 $y0 $z0)   // 0
    ($x1 $y0 $z0)   // 1
    ($x1 $y0 $z1)   // 2
    ($x0 $y0 $z1)   // 3

    // y = y1 (i = 1)
    ($x0 $y1 $z0)   // 4
    ($x1 $y1 $z0)   // 5
    ($x1 $y1 $z1)   // 6
    ($x0 $y1 $z1)   // 7

    // y = y2 (i = 2)
    ($x0 $y2 $z0)   // 8
    ($x1 $y2 $z0)   // 9
    ($x1 $y2 $z1)   // 10
    ($x0 $y2 $z1)   // 11

    // y = y3 (i = 3)
    ($x0 $y3 $z0)   // 12
    ($x1 $y3 $z0)   // 13
    ($x1 $y3 $z1)   // 14
    ($x0 $y3 $z1)   // 15

    // y = y4 (i = 4)
    ($x0 $y4 $z0)   // 16
    ($x1 $y4 $z0)   // 17
    ($x1 $y4 $z1)   // 18
    ($x0 $y4 $z1)   // 19

    // y = y5 (i = 5)
    ($x0 $y5 $z0)   // 20
    ($x1 $y5 $z0)   // 21
    ($x1 $y5 $z1)   // 22
    ($x0 $y5 $z1)   // 23
);

// Cell counts: Nx = 182 (~10 um), Nz = 8 (~2.9 um)
// Y counts target ~10 um per cell within each band.
blocks
(
    hex (0  1  5  4  3  2  6  7)   (364 52 8)  simpleGrading (1 1 1) // inlet1 band
    hex (4  5  9  8  7  6  10 11)  (364 16 8)  simpleGrading (1 1 1) // gap1 band
    hex (8  9  13 12 11 10 14 15)  (364 52 8)  simpleGrading (1 1 1) // inlet2 band
    hex (12 13 17 16 15 14 18 19)  (364 16 8)  simpleGrading (1 1 1) // gap2 band
    hex (16 17 21 20 19 18 22 23)  (364 52 8)  simpleGrading (1 1 1) // inlet3 band
);

edges
(
);

boundary
(
    inlet1
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    inlet2
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }

    inlet3
    {
        type patch;
        faces
        (
            (16 20 23 19)
        );
    }

    inletWalls
    {
        type wall;
        faces
        (
            (4 8 11 7)
            (12 16 19 15)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5  6  2)
            (5 9  10 6)
            (9 13 14 10)
            (13 17 18 14)
            (17 21 22 18)
        );
    }

    yMin
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    yMax
    {
        type wall;
        faces
        (
            (20 21 22 23)
        );
    }

    zMin
    {
        type wall;
        faces
        (
            (0 4  5  1)
            (4 8  9  5)
            (8 12 13 9)
            (12 16 17 13)
            (16 20 21 17)
        );
    }

    zMax
    {
        type wall;
        faces
        (
            (3 2  6  7)
            (7 6  10 11)
            (11 10 14 15)
            (15 14 18 19)
            (19 18 22 23)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
