runs/mixingPrecipitation/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0001 0 0);

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform (0.0001 0 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (0.0001 0 0);
    }
    inlet3
    {
        type            fixedValue;
        value           uniform (0.0001 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.0001 0 0);
        inletValue      uniform (0.0001 0 0);
    }
    inletWalls
    {
        type            noSlip;
    }
    yMin
    {
        type            noSlip;
    }
    yMax
    {
        type            noSlip;
    }
    zMin
    {
        type            noSlip;
    }
    zMax
    {
        type            noSlip;
    }
}

// ************************************************************************* //
