runs/mixingPrecipitation/0.orig/Ccation
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ccation;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform 0.32;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet3
    {
        type            fixedValue;
        value           uniform 0.32;
    }
    inletWalls
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    yMin
    {
        type            zeroGradient;
    }
    yMax
    {
        type            zeroGradient;
    }
    zMin
    {
        type            zeroGradient;
    }
    zMax
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
